read_verilog ~/genetic-circuit-partitioning/2021.4/runs/benchmark/Circuits/Voter/voter
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ~/genetic-circuit-partitioning/2021.4/runs/benchmark/Circuits/Voter/voter/voter_yosys
write_edif ~/genetic-circuit-partitioning/2021.4/runs/benchmark/Circuits/Voter/voter/voter.edif
write_json ~/genetic-circuit-partitioning/2021.4/runs/benchmark/Circuits/Voter/voter/voter.json
