read_verilog ./Circuits/Voter/voter4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Voter/voter4/voter4_yosys
write_edif ./Circuits/Voter/voter4/voter4.edif
write_json ./Circuits/Voter/voter4/voter4.json
