read_verilog ./Circuits/PriorityEncoder/priority_encoder4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/PriorityEncoder/priority_encoder4/priority_encoder4_yosys
write_edif ./Circuits/PriorityEncoder/priority_encoder4/priority_encoder4.edif
write_json ./Circuits/PriorityEncoder/priority_encoder4/priority_encoder4.json
