read_verilog ./Circuits/mux/mux32.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/mux/mux32/mux32_yosys
write_edif ./Circuits/mux/mux32/mux32.edif
write_json ./Circuits/mux/mux32/mux32.json
