read_verilog ./Circuits/PriorityEncoder/priority_encoder16.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/PriorityEncoder/priority_encoder16/priority_encoder16_yosys
write_edif ./Circuits/PriorityEncoder/priority_encoder16/priority_encoder16.edif
write_json ./Circuits/PriorityEncoder/priority_encoder16/priority_encoder16.json
