read_verilog ./Circuits/RCA/RCA8.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/RCA/RCA8/RCA8_yosys
write_edif ./Circuits/RCA/RCA8/RCA8.edif
write_json ./Circuits/RCA/RCA8/RCA8.json
