read_verilog ./Circuits/RCA/RCA4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/RCA/RCA4/RCA4_yosys
write_edif ./Circuits/RCA/RCA4/RCA4.edif
write_json ./Circuits/RCA/RCA4/RCA4.json
