read_verilog ./Circuits/mux/mux4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/mux/mux4/mux4_yosys
write_edif ./Circuits/mux/mux4/mux4.edif
write_json ./Circuits/mux/mux4/mux4.json
