read_verilog ./Circuits/Parity/parity4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Parity/parity4/parity4_yosys
write_edif ./Circuits/Parity/parity4/parity4.edif
write_json ./Circuits/Parity/parity4/parity4.json
