read_verilog ./Circuits/RCA/RCA64.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/RCA/RCA64/RCA64_yosys
write_edif ./Circuits/RCA/RCA64/RCA64.edif
write_json ./Circuits/RCA/RCA64/RCA64.json
