read_verilog ./Circuits/Voter/voter16.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Voter/voter16/voter16_yosys
write_edif ./Circuits/Voter/voter16/voter16.edif
write_json ./Circuits/Voter/voter16/voter16.json
