read_verilog ./Circuits/RCA/RCA16.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/RCA/RCA16/RCA16_yosys
write_edif ./Circuits/RCA/RCA16/RCA16.edif
write_json ./Circuits/RCA/RCA16/RCA16.json
