read_verilog ./Circuits/mux/mux.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/mux/mux/mux_yosys
write_edif ./Circuits/mux/mux/mux.edif
write_json ./Circuits/mux/mux/mux.json
