read_verilog ./Circuits/mux/mux8.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/mux/mux8/mux8_yosys
write_edif ./Circuits/mux/mux8/mux8.edif
write_json ./Circuits/mux/mux8/mux8.json
