read_verilog ./Circuits/Voter/voter32.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Voter/voter32/voter32_yosys
write_edif ./Circuits/Voter/voter32/voter32.edif
write_json ./Circuits/Voter/voter32/voter32.json
