read_verilog ./Circuits/Parity/parity32.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Parity/parity32/parity32_yosys
write_edif ./Circuits/Parity/parity32/parity32.edif
write_json ./Circuits/Parity/parity32/parity32.json
