read_verilog ./Circuits/RCA/RCA32.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/RCA/RCA32/RCA32_yosys
write_edif ./Circuits/RCA/RCA32/RCA32.edif
write_json ./Circuits/RCA/RCA32/RCA32.json
