read_verilog ./Circuits/Parity/parity.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Parity/parity/parity_yosys
write_edif ./Circuits/Parity/parity/parity.edif
write_json ./Circuits/Parity/parity/parity.json
